{
  "textos": [
    "A rápida raposa marrom salta sobre o cão preguiçoso. Este texto contém todas as letras do alfabeto.",
    "O sucesso é a soma de pequenos esforços repetidos dia após dia. Continue praticando sua digitação.",
    "A tecnologia move o mundo. Dominar o teclado é o primeiro passo para se tornar um especialista.",
    "Aprender a digitar corretamente não é apenas sobre velocidade, mas também sobre precisão e conforto.",
    "O pinguim que vivia no iceberg gostava de tomar um suco de kiwi com uva e melancia.",
    "O hardware é a parte física do computador, como o teclado, o mouse e o monitor. O software são os programas e aplicativos.",
    "Aprender atalhos de teclado, como Ctrl+C e Ctrl+V, pode aumentar muito a sua produtividade no dia a dia.",
    "A prática constante é o segredo para a perfeição. Cada dia de treino de digitação te deixa mais perto do seu objetivo.",
    "Não tenha medo de cometer erros. Cada erro é uma oportunidade para aprender e melhorar sua precisão.",
    "A internet conecta milhões de pessoas ao redor do mundo, permitindo a troca de informações e comunicação instantânea.",
    "Manter uma boa postura, com as costas retas e os pulsos nivelados, é fundamental para evitar lesões e digitar com conforto.",
    "Gazeta publica hoje no jornal uma breve nota de faxina na quermesse.",
    "O Brasil é o quinto maior país do mundo em área territorial e o maior produtor mundial de café.",
    "A paciência é uma virtude. Aprender a digitar leva tempo, mas os resultados valem a pena e duram para sempre.",
    "Um arquivo pode ser salvo na nuvem, o que significa que ele fica armazenado em servidores online e pode ser acessado de qualquer lugar.",
    "A programação é como escrever instruções para que o computador execute tarefas de forma precisa e rápida.",
    "HTML é a linguagem de marcação usada para estruturar páginas da web, enquanto CSS define seu estilo visual.",
    "O processador é o cérebro do computador, responsável por interpretar e executar as instruções dos programas.",
    "Os backups regulares garantem que seus dados fiquem seguros mesmo em caso de falhas ou ataques cibernéticos.",
    "Um bom desenvolvedor testa seu código constantemente para evitar erros e melhorar a experiência do usuário.",
    "A segurança digital envolve o uso de senhas fortes, autenticação de dois fatores e atualizações de software.",
    "No mundo da tecnologia, aprender continuamente é essencial para acompanhar as rápidas mudanças do setor.",
    "O comando Ctrl+Z desfaz a última ação, enquanto Ctrl+Y refaz a ação desfeita, economizando tempo e esforço.",
    "O armazenamento SSD é mais rápido e silencioso que o HD tradicional, melhorando o desempenho do computador.",
    "As redes sociais permitem compartilhar ideias e projetos, mas é importante manter a privacidade e segurança online.",
    "Um bom fluxo de trabalho no computador envolve organização de pastas e arquivos para facilitar o acesso e evitar perda de dados.",
    "JavaScript é uma linguagem essencial para o desenvolvimento web interativo e dinâmico.",
    "A memória RAM armazena dados temporários para que o processador possa acessá-los rapidamente.",
    "O firewall atua como uma barreira de proteção entre o computador e ameaças externas na internet.",
    "Os algoritmos são conjuntos de instruções organizadas para resolver problemas ou executar tarefas específicas.",
    "O Linux é um sistema operacional de código aberto usado tanto em servidores quanto em computadores pessoais.",
    "O phishing é um tipo de golpe online que tenta enganar usuários para roubar informações pessoais.",
    "O comando Ctrl+S salva seu progresso e evita a perda de dados em caso de falhas inesperadas.",
    "O mouse pode ser configurado para diferentes velocidades e funções, adaptando-se ao estilo do usuário.",
    "No desenvolvimento de software, versionamento de código é fundamental para acompanhar mudanças e colaborar em equipe.",
    "As impressoras modernas podem se conectar via Wi-Fi, eliminando a necessidade de cabos.",
    "A inteligência artificial é capaz de analisar grandes quantidades de dados e aprender com eles.",
    "As atualizações de sistema corrigem vulnerabilidades e melhoram a performance do computador.",
    "O teclado mecânico oferece mais durabilidade e resposta tátil em comparação aos teclados de membrana.",
    "A computação em nuvem permite acessar arquivos e programas sem precisar de um computador potente localmente.",
    "O e-mail é uma das formas mais antigas de comunicação digital e ainda é amplamente utilizado.",
    "O Git é uma ferramenta de controle de versão distribuída usada por desenvolvedores em todo o mundo.",
    "O monitor de alta resolução proporciona imagens mais nítidas e detalhadas para jogos e design gráfico.",
    "A criptografia protege informações confidenciais contra acessos não autorizados.",
    "O cache do navegador armazena arquivos temporários para acelerar o carregamento de páginas.",
    "A placa-mãe conecta todos os componentes do computador e permite que eles funcionem juntos.",
    "O reconhecimento facial é uma tecnologia biométrica cada vez mais presente em smartphones e sistemas de segurança.",
    "Os drivers permitem que o sistema operacional se comunique corretamente com o hardware.",
    "Um bom hábito é fazer limpeza periódica nos arquivos do computador para manter o desempenho.",
    "A automação de tarefas com scripts pode economizar horas de trabalho repetitivo.",
    "A refrigeração adequada evita o superaquecimento e aumenta a vida útil dos componentes do PC."
  ]
}
