{
  "textos": [
    "Ser trans é tipo atualizar o sistema: demora, dá erro às vezes, mas no fim o desempenho melhora e ninguém mais quer voltar pra versão antiga.",
    "Sou uma mulher trans, não um bug do sistema. Se não entende, reinicie seus preconceitos.",
    "O corpo é meu hardware, a identidade é meu sistema operacional. E não, você não tem permissão pra acessar as configurações.",
    "Enquanto uns fazem backup de fofoca, eu tô aqui fazendo upload da minha coragem todo dia.",
    "O sistema tentou me formatar, mas eu instalei resistência com privilégio de administrador.",
    "Minha existência não precisa de patch de correção, o erro tá no sistema social.",
    "Ser trans é como rodar um script de autenticidade: às vezes demora, mas o resultado é puro código limpo.",
    "Não sou erro de digitação — sou um manifesto em tempo real sendo compilado no caos.",
    "O sistema não tava preparado pro meu update. Buguei a norma e executei minha própria versão.",
    "Dizem que eu sou 'fora do padrão'. Perfeito, padrões são pra máquinas, não pra humanos.",
    "A transição não é uma falha de sistema, é uma melhoria de performance.",
    "Falam que ser trans é difícil. Difícil é lidar com gente que ainda tá na versão beta da empatia.",
    "Sou trans, logo, resisto. Porque existir num mundo binário é um ato revolucionário de código aberto.",
    "Vivo num sistema que tenta me dar 'acesso negado', mas eu aprendi a hackear a vida.",
    "Minha identidade não precisa de autenticação em dois fatores. Já nasci legítima.",
    "Erro 404: gênero imposto não encontrado.",
    "Ser trans é como reescrever o próprio código-fonte. Só quem programa sabe o quanto dá trabalho, mas o resultado é lindo.",
    "O mundo queria me colocar num if sem else. Eu preferi escrever meu próprio switch case.",
    "Sistema travou ao tentar processar minha autenticidade. Reinstalando respeito...",
    "Transfobia é tipo antivírus mal configurado: bloqueia o que não entende e causa mais dano do que protege.",
    "Minha resistência é de código-fonte aberto. Todo mundo pode aprender, mas nem todo mundo compila.",
    "Disseram que eu devia seguir o manual. Eu preferi reescrever o sistema operacional.",
    "Ser trans é acordar todo dia e digitar ‘continue();’ num código que o mundo tenta interromper com ‘break;’.",
    "Enquanto uns me chamam de erro, o universo me executa sem bugs.",
    "Sou uma atualização que o patriarcado não autorizou, mas que o futuro já baixou.",
    "Resistir é minha linguagem de programação favorita.",
    "O gênero binário é só uma variável booleana. Eu prefiro arrays infinitos de possibilidades.",
    "O mundo tenta me apagar, mas eu sou tipo aquele arquivo protegido do sistema: não dá pra deletar.",
    "Falar que 'é só uma fase' é tipo dizer que o Linux vai virar Windows se der tempo.",
    "Meu orgulho não é só um emoji colorido — é um firewall contra a ignorância."
  ]
}
